tests/load/economy.load.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN || 'test-token' }}"
  processor: "./helpers/economy-helpers.js"
  variables:
    gift_ids:
      - "00000000-0000-0000-0000-000000001001"
      - "00000000-0000-0000-0000-000000001002"
      - "00000000-0000-0000-0000-000000001003"
    receiver_ids:
      - "00000000-0000-0000-0000-000000002001"
      - "00000000-0000-0000-0000-000000002002"
      - "00000000-0000-0000-0000-000000002003"
    package_ids:
      - "com.hellotalk.coins.small"
      - "com.hellotalk.coins.medium"
      - "com.hellotalk.coins.large"
      - "com.hellotalk.coins.xlarge"
    sticker_pack_ids:
      - "sticker_pack_animals"
      - "sticker_pack_emoji"
      - "sticker_pack_flags"
      - "sticker_pack_love"
    receipt_platforms:
      - "ios"
      - "android"
      - "web"
    room_ids:
      - "00000000-0000-0000-0000-000000003001"
      - "00000000-0000-0000-0000-000000003002"

scenarios:
  - name: "Gift catalog lookup"
    weight: 10
    flow:
      - get:
          url: "/economy/catalog"
          expect:
            - statusCode: 200

  - name: "Coin packages lookup"
    weight: 10
    flow:
      - get:
          url: "/economy/packages"
          expect:
            - statusCode: 200

  - name: "User coin balance"
    weight: 15
    flow:
      - get:
          url: "/economy/balance"
          expect:
            - statusCode: 200

  - name: "Daily check-in claim"
    weight: 10
    flow:
      - post:
          url: "/economy/daily-check-in"
          expect:
            - statusCode: 201

  - name: "Create Stripe checkout session"
    weight: 10
    flow:
      - post:
          url: "/economy/create-checkout-session"
          json:
            package_id: "{{ package_ids }}"
          expect:
            - statusCode: 201

  - name: "Purchase coins (web)"
    weight: 8
    flow:
      - post:
          url: "/economy/purchase-coins"
          json:
            receipt_token: "load-test-receipt-{{ $randomNumber(10000, 99999) }}"
            platform: "web"
          expect:
            - statusCode: 201

  - name: "Purchase coins (mobile)"
    weight: 7
    flow:
      - post:
          url: "/economy/purchase-coins"
          json:
            receipt_token: "load-test-receipt-{{ $randomNumber(10000, 99999) }}"
            platform: "{{ receipt_platforms }}"
          expect:
            - statusCode: 201

  - name: "Send gift"
    weight: 10
    flow:
      - post:
          url: "/economy/send-gift"
          json:
            receiver_id: "{{ receiver_ids }}"
            gift_id: "{{ gift_ids }}"
          expect:
            - statusCode: 201

  - name: "Send gift in room"
    weight: 5
    flow:
      - post:
          url: "/economy/send-gift"
          json:
            receiver_id: "{{ receiver_ids }}"
            gift_id: "{{ gift_ids }}"
            room_id: "{{ room_ids }}"
          expect:
            - statusCode: 201

  - name: "Sticker packs storefront"
    weight: 8
    flow:
      - get:
          url: "/economy/sticker-packs"
          expect:
            - statusCode: 200

  - name: "Unlock sticker pack"
    weight: 7
    flow:
      - post:
          url: "/economy/unlock-sticker-pack"
          json:
            pack_id: "{{ sticker_pack_ids }}"
          expect:
            - statusCode: 201