tests/load/escrow-payments.load.yml
config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3000' }}"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN || 'test-token' }}"
  processor: "./helpers/escrow-payments-helpers.js"
  variables:
    escrow_id:
      - "00000000-0000-0000-0000-000000002001"
      - "00000000-0000-0000-0000-000000002002"
      - "00000000-0000-0000-0000-000000002003"
    dispute_reasons:
      - "service_not_delivered"
      - "quality_unsatisfactory"
      - "wrong_service"
      - "other"
    milestone_indices:
      - 0
      - 1
      - 2
    status_filters:
      - "pending"
      - "in_progress"
      - "completed"
      - "disputed"
      - "refunded"
    sort_orders:
      - "asc"
      - "desc"

scenarios:
  # --- READ-HEAVY SCENARIOS (65% combined weight) ---

  - name: "List user escrow transactions"
    weight: 15
    flow:
      - get:
          url: "/escrow/transactions?page=1&limit=20&status={{ status_filters }}&sort={{ sort_orders }}"
          expect:
            - statusCode: 200

  - name: "Get escrow transaction by ID"
    weight: 15
    flow:
      - get:
          url: "/escrow/transactions/{{ escrow_id }}"
          expect:
            - statusCode: 200

  - name: "Check escrow transaction status"
    weight: 12
    flow:
      - get:
          url: "/escrow/transactions/{{ escrow_id }}/status"
          expect:
            - statusCode: 200

  - name: "Get escrow summary statistics"
    weight: 8
    flow:
      - get:
          url: "/escrow/summary"
          expect:
            - statusCode: 200

  - name: "List escrow transactions as recipient"
    weight: 8
    flow:
      - get:
          url: "/escrow/transactions?role=recipient&page=1&limit=20&status={{ status_filters }}"
          expect:
            - statusCode: 200

  - name: "List escrow transactions as payer"
    weight: 7
    flow:
      - get:
          url: "/escrow/transactions?role=payer&page=1&limit=20"
          expect:
            - statusCode: 200

  # --- WRITE SCENARIOS (35% combined weight) ---

  - name: "Create escrow transaction"
    weight: 12
    flow:
      - function: "generateEscrowPayload"
      - post:
          url: "/escrow/transactions"
          json:
            recipient_id: "{{ recipient_id }}"
            amount: "{{ escrow_amount }}"
            currency: "{{ escrow_currency }}"
            description: "{{ escrow_description }}"
            milestone_count: "{{ milestone_count }}"
          expect:
            - statusCode: 201

  - name: "Release escrow milestone"
    weight: 8
    flow:
      - post:
          url: "/escrow/transactions/{{ escrow_id }}/release"
          json:
            milestone_index: "{{ milestone_indices }}"
          expect:
            - statusCode: 200

  - name: "Refund escrow transaction"
    weight: 6
    flow:
      - post:
          url: "/escrow/transactions/{{ escrow_id }}/refund"
          json:
            reason: "{{ $randomChoice('buyer_request', 'mutual_agreement', 'admin_override') }}"
          expect:
            - statusCode: 200

  - name: "File escrow dispute"
    weight: 5
    flow:
      - post:
          url: "/escrow/transactions/{{ escrow_id }}/dispute"
          json:
            reason: "{{ dispute_reasons }}"
            description: "Load test dispute filed at {{ $now }}"
          expect:
            - statusCode: 201

  - name: "Cancel escrow transaction"
    weight: 4
    flow:
      - post:
          url: "/escrow/transactions/{{ escrow_id }}/cancel"
          json:
            reason: "Load test cancellation at {{ $now }}"
          expect:
            - statusCode: 200